Repository: govuk-one-login/mobile-ios-one-login-app
Catalog: Sources/Resources/*.lproj/Localizable.strings
Languages: cy_gb

# app_closeButton
source: Close
cy_gb: Cau

# app_cancelButton
source: Cancel
cy_gb: Canslo

# app_tryAgainButton
source: Go back and try again
cy_gb: Ewch yn ôl i roi cynnig eto

# app_continueButton
source: Continue
cy_gb: Parhau

# app_agreeButton
source: Agree
cy_gb: Cytuno

# app_disagreeButton
source: Disagree
cy_gb: Anghytuno

# app_loadingBody
source: Loading
cy_gb: Llwytho

# app_skipButton
source: Skip
cy_gb: Osgoi

# app_enterPasscodeButton
source: Enter passcode
cy_gb: Rhowch god mynediad

# app_exitButton
source: Exit
cy_gb: Gadael

# app_externalBrowser
source: Opens in web browser
cy_gb: Agor mewn porwr gwe

# app_externalApp
source: Opens in App Store
cy_gb: Yn agor yn yr App Store

# app_loadingLabel
source: Loading GOV.UK One Login
cy_gb: Llwytho %@

# app_faceId_subtitle
source: Enter iPhone passcode
cy_gb: Rhowch god mynediad iPhone

# app_touchId_subtitle
source: Unlock to proceed
cy_gb: Datgloi i barhau

# app_signInBody
source: Prove your identity to access government services. You’ll need to sign in with your GOV.UK One Login details.
cy_gb: Profwch eich hunaniaeth i gael mynediad at wasanaethau'r llywodraeth. Bydd angen i chi fewngofnodi gyda'ch manylion %@.

# app_signInButton
source: Sign in
cy_gb: Mewngofnodi

# app_extendedSignInButton
source: Sign in with GOV.UK One Login
cy_gb: Mewngofnodi gyda %@

# app_acceptAnalyticsPreferences_title
source: Help improve the app by sharing analytics
cy_gb: Helpu i wella'r ap drwy rannu dadansoddi

# acceptAnalyticsPreferences_body
source: You can help the One Login team make improvements by sharing analytics about how you use the app. These analytics are anonymous. They show us what is and is not working, and help make the app better. You can stop sharing these analytics any time by changing your app settings.
cy_gb: Gallwch helpu'r tîm %@ i wneud gwelliannau drwy rannu dadansoddeg am sut rydych yn defnyddio'r ap. Gallwch stopio rhannu'r dadansoddeg hyn ar unrhyw amser. Ewch i osodiadau eich ffôn a dewiswch yr ap %@ i weld neu newid eich gosodiadau ap. Gallwch stopio rhannu'r dadansoddiadau hyn ar unrhyw bryd trwy newid gosodiadau eich ap.

# app_privacyNoticeLink
source: Read more about this in the GOV.UK One Login privacy notice
cy_gb: Darllenwch fwy am hyn yn hysbysiad preifatrwydd %@

# app_shareAnalyticsButton
source: Share analytics
cy_gb: Rhannu dadansoddeg

# app_doNotShareAnalytics
source: Skip for now
cy_gb: Osgoi am y tro

# app_signInErrorTitle
source: There was a problem signing you in
cy_gb: Roedd problem wrth eich mewngofnodi

# app_signInErrorBody
source: You can try signing in again. If this does not work, you may need to try again later.
cy_gb: Gallwch geisio mewngofnodi eto. Os na fydd hyn yn gweithio, efallai y bydd angen i chi roi cynnig arall yn nes ymlaen.

# app_networkErrorTitle
source: You are not connected to the internet
cy_gb: Nid ydych wedi'ch cysylltu â'r rhyngrwyd

# app_networkErrorBody
source: You need to have an internet connection to use GOV.UK One Login. Reconnect to the internet and try again.
cy_gb: Mae angen i chi gael cysylltiad rhyngrwyd i ddefnyddio %@. Ailgysylltwch â'r rhyngrwyd a rhoi cynnig eto.

# app_genericErrorPage
source: Sorry, there’s a problem
cy_gb: Mae'n ddrwg gennym, mae yna broblem

# app_genericErrorPageBody
source: Try again later.
cy_gb: Rhowch gynnig arall yn nes ymlaen.

# app_enableLoginBiometricsTitle
source: Unlock the app with %@
cy_gb: Datgloi'r ap gyda %@

# app_enableFaceIDBody
source: You can use Face ID to unlock the app within 30 minutes of signing in with GOV.UK One Login. If you allow Face ID, anyone who can unlock your phone with their face or with your phone's passcode will be able to access your app.
cy_gb: Gallwch ddefnyddio Face ID i ddatgloi'r ap o fewn 30 munud o fewngofnodi gyda %@. Os ydych yn caniatáu Face ID, bydd unrhyw un sy'n gallu datgloi eich ffôn gyda'u gwyneb neu gyda chod eich ffôn yn gallu cael mynediad i'ch ap.

# app_enableTouchIDBody
source: You can use your fingerprint to unlock the app within 30 minutes of signing in with GOV.UK One Login. If you allow Touch ID, anyone who can unlock your phone with their fingerprint or with your phone's passcode will be able to access your app.
cy_gb: Gallwch ddefnyddio eich olion bysedd i ddatgloi'r ap o fewn 30 munud o fewngofnodi gyda %@. Os ydych yn caniatáu Touch ID, bydd unrhyw un sy'n gallu datgloi eich ffôn gyda'u olion bysedd neu gyda chod eich ffôn yn gallu cael mynediad i'ch ap.

# app_enableBiometricsButton
source: Allow %@
cy_gb: Caniatáu %@

# app_enableBiometricsTitle
source: Allow %@
cy_gb: Caniatáu %@

# app_enableBiometricsBody1
source: Use %@ to:
cy_gb: Defnyddiwch %@ i:

# app_enableBiometricsBullet1
source: unlock the app within 30 minutes of signing in with GOV.UK One Login
cy_gb: ddatgloi'r ap o fewn 30 munud ar ôl mewngofnodi gyda %@

# app_enableBiometricsBullet2
source: view and add documents
cy_gb: gweld ac ychwanegu dogfennau

# app_enableBiometricsFaceIDBody2
source: If you allow Face ID, anyone who can unlock your phone with their face or with your phone's passcode will be able to access your app. You can turn off Face ID for this app anytime in your phone settings.
cy_gb: Os ydych yn caniatáu Face ID, bydd unrhyw un sy'n gallu datgloi eich ffôn gyda'u gwyneb neu gyda chod eich ffôn yn gallu cael mynediad i'ch ap. Gallwch droi Face ID i ffwrdd ar gyfer yr ap hwn unrhyw bryd yng ngosodiadau eich ffôn.

# app_enableBiometricsTouchIDBody2
source: If you allow Touch ID, anyone who can unlock your phone with their fingerprint or with your phone's passcode will be able to access your app.
cy_gb: Os ydych yn caniatáu Touch ID, bydd unrhyw un sy'n gallu datgloi eich ffôn gyda'u olion bysedd neu gyda chod eich ffôn yn gallu cael mynediad i'ch ap.

# app_unlockButton
source: Unlock
cy_gb: Datgloi

# app_homeTitle
source: Home
cy_gb: Hafan

# app_displayEmail
source: You’re signed in as %@
cy_gb: Rydych wedi mewngofnodi fel %@

# app_walletTitle
source: Wallet
cy_gb: Waled

# app_settingsTitle
source: Settings
cy_gb: Gosodiadau

# app_settingsSignInDetailsTile
source: Your GOV.UK One login
cy_gb: Eich %@

# app_settingsSignInDetailsLink
source: Manage your sign in details
cy_gb: Rheoli eich manylion mewngofnodi

# app_settingsSignInDetailsFootnote
source: You might need to sign in again to manage your GOV.UK One Login details.
cy_gb: Efallai y bydd angen i chi fewngofnodi eto i reoli eich manylion %@.

# app_settingsSubtitle1
source: Help and feedback
cy_gb: Help ac adborth

# app_appGuidanceLink
source: Using the GOV.UK One Login app
cy_gb: Defnyddio'r ap %@

# app_contactLink
source: Contact GOV.UK One Login
cy_gb: Cysylltu %@

# app_settingsSubtitle2
source: About the app
cy_gb: Am yr ap

# app_settingsAnalyticsToggle
source: Share app analytics
cy_gb: Rhannu dadansoddeg yr ap

# app_settingsAnalyticsToggleFootnote
source: You can share anonymous analytics about how you use the app to help the GOV.UK One Login team make improvements. Read more in the GOV.UK One Login privacy notice.
cy_gb: Gallwch rannu dadansoddeg anhysbys am sut rydych yn defnyddio'r ap i helpu'r tîm %@ i wneud gwelliannau. Darllenwch fwy yn yr hysbysiad preifatrwydd %@.

# app_privacyNoticeLink2
source: GOV.UK One Login privacy notice
cy_gb: Rhybudd Preifatrwydd %@

# app_accessibilityStatement
source: Accessibility statement
cy_gb: Datganiad hygyrchedd

# app_signOutButton
source: Sign out
cy_gb: Allgofnodi

# app_signOutConfirmationTitle
source: Are you sure you want to sign out?
cy_gb: Ydych chi'n siwr eich bod chi eisiau allgofnodi?

# app_signOutConfirmationBody1
source: If you sign out, the information saved in your app will be deleted. This is to reduce the risk that someone else will see your information.
cy_gb: Os byddwch yn allgofnodi, bydd y wybodaeth a gedwir yn eich ap yn cael ei dileu. Mae hyn er mwyn lleihau'r risg y bydd rhywun arall yn gweld eich gwybodaeth.

# app_signOutConfirmationBody2
source: This means:
cy_gb: Mae hyn yn golygu:

# app_signOutConfirmationBullet1
source: any documents saved in your GOV.UK Wallet will be removed
cy_gb: bydd unrhyw ddogfennau a arbedir yn eich %@ yn cael eu dileu

# app_signOutConfirmationBullet2
source: if you’re using Face ID or Touch ID to unlock the app, this will be switched off
cy_gb: os ydych yn defnyddio Face ID neu Touch ID i ddatgloi'r ap, bydd hyn yn cael ei ddiffodd

# app_signOutConfirmationBullet3
source: you’ll stop sharing analytics about how you use the app
cy_gb: byddwch yn stopio rhannu dadansoddeg am sut rydych yn defnyddio'r ap

# app_signOutConfirmationBody3
source: Next time you sign in, you’ll be able to add your documents to your GOV.UK Wallet and set your preferences again.
cy_gb: Y tro nesaf y byddwch yn mewngofnodi, gallwch ychwanegu eich dogfennau at eich %@ a gosod eich dewisiadau eto.

# app_signOutAndDeleteAppDataButton
source: Sign out and delete information
cy_gb: Mewngofnodi a dileu gwybodaeth

# app_signOutConfirmationTitleNoWallet
source: Are you sure you want to sign out?
cy_gb: Ydych chi'n siŵr eich bod eisiau allgofnodi?

# app_signOutConfirmationBody1NoWallet
source: Signing out will switch off your preferences for:
cy_gb: Bydd allgofnodi yn difodd eich dewisiadau am:

# app_signOutConfirmationBullet1iOSNoWallet
source: using Touch ID or Face ID to unlock the app
cy_gb: ddefnyddio Touch ID neu Face ID i ddatgloi'r ap

# app_signOutConfirmationBullet2NoWallet
source: sharing analytics about how you use the app
cy_gb: rhannu dadansoddeg am sut rydych yn defnyddio'r ap

# app_signOutConfirmationBody2NoWallet
source: You’ll be asked to set these preferences again next time you sign in.
cy_gb: Gofynnir i chi osod y dewisiadau hyn eto y tro nesaf y byddwch yn mewngofnodi.

# app_signOutAndDeletePreferences
source: Sign out and delete preferences
cy_gb: Allgofnodi a dileu dewisiadau

# app_signOutErrorTitle
source: There was a problem signing you out
cy_gb: Roedd problem wrth eich allgofnodi

# app_signOutErrorBody
source: You can force sign out by deleting the app from your device.
cy_gb: Gallwch orfodi allgofnodi trwy ddileu'r ap o'ch dyfais.

# app_signOutWarningTitle
source: You need to sign in again
cy_gb: Mae angen i chi fewngofnodi eto

# app_signOutWarningBody
source: It’s been more than 30 minutes since you last signed in to the GOV.UK One Login app. Sign in again to continue.
cy_gb: Mae mwy na 30 munud wedi mynd heibio ers i chi fewngofnodi ddiwethaf i ap %@. Mewngofnodwch eto i barhau.

# app_dataDeletionWarningTitle
source: Something went wrong
cy_gb: Mae rhywbeth wedi mynd o'i le

# app_dataDeletionWarningBodyNoWallet
source: We could not confirm your sign in details. To keep your information secure, your preference for using Touch ID or Face ID to unlock the app has been reset. You need to sign in and set your preferences again to continue using the app.
cy_gb: Nid oeddem yn gallu cadarnhau eich manylion mewngofnodi. Er mwyn cadw'ch gwybodaeth yn ddiogel, mae eich dewis o ddefnyddio Touch ID neu Face ID i ddatgloi'r ap wedi'i ailosod. Mae angen i chi fewngofnodi a gosod eich dewisiadau eto i barhau i ddefnyddio'r ap.

# app_dataDeletionWarningBody
source: We could not confirm your sign in details. To keep your information secure, any documents in your GOV.UK Wallet have been removed and your app preferences have been reset. You need to sign in again and set your preferences again to continue using the app. You’ll then be able to add documents to you GOV.UK Wallet.
cy_gb: Ni allem gadarnhau eich manylion mewngofnodi. Er mwyn cadw'ch gwybodaeth yn ddiogel, mae unrhyw ddogfennau yn eich %@ wedi'u dileu ac mae eich dewisiadau ap wedi'u hailosod. Mae angen i chi fewngofnodi eto a gosod eich dewisiadau eto i barhau i ddefnyddio'r ap. Yna byddwch yn gallu ychwanegu dogfennau at eich %@.

# app_updateAppTitle
source: You need to update your app
cy_gb: Mae angen i chi ddiweddaru eich ap

# app_updateAppBody
source: You’re using an old version of the GOV.UK One Login app. Update your app to continue.
cy_gb: Rydych yn defnyddio hen fersiwn o'r ap %@. Diweddarwch eich ap i barhau.

# app_updateAppButton
source: Update GOV.UK One Login app
cy_gb: Diweddaru Ap %@

# app_welcomeTileHeader
source: Welcome
cy_gb: Croeso

# app_welcomeTileBody1
source: You can use this app to prove your identity to access some government services.
cy_gb: Gallwch ddefnyddio'r ap hwn i brofi eich hunaniaeth i gael mynediad at rai gwasanaethau'r llywodraeth.

# app_appPurposeTileHeader
source: How to prove your identity
cy_gb: Sut i brofi eich hunaniaeth

# app_appPurposeTileBody1
source: If you need to prove your identity with GOV.UK One Login to access a service, you'll be asked to open this app. It works by matching your face to your photo ID.
cy_gb: Os oes angen i chi brofi eich hunaniaeth gyda %@ i gael mynediad at wasanaeth, gofynnir i chi agor yr ap hwn. Mae'n gweithio trwy baru eich wyneb â'ch ID gyda llun.

# app_appUnavailableTitle
source: Sorry, the app is unavailable
cy_gb: Mae'n ddrwg gennym, nid yw'r ap ar gael

# app_appUnavailableBody
source: You cannot use the GOV.UK One Login app at the moment. Try again later.
cy_gb: Ni allwch ddefnyddio'r ap %@ ar hyn o bryd. Rhowch gynnig arall yn nes ymlaen.

# app_localAuthManagerErrorTitle
source: You need to update your phone settings
cy_gb: Mae angen i chi ddiweddaru gosodiadau eich ffôn

# app_localAuthManagerErrorBody1
source: To add documents to your GOV.UK Wallet, you need to protect your phone with a passcode. This is to make sure no one else can view or add documents to your wallet.
cy_gb: I ychwanegu dogfennau at eich %@, mae angen i chi ddiogelu eich ffôn gyda chod. Mae hyn er mwyn sicrhau nad oes unrhyw un arall yn gallu gweld neu ychwanegu dogfennau at eich waled.

# app_localAuthManagerErrorBody3
source: You need to:
cy_gb: Mae angen i chi:

# app_localAuthManagerErrorNumberedList1FaceID
source: Go to Face ID & Passcode in your phone settings.
cy_gb: Fynd i Face ID & Passcode yng ngosodiadau eich ffôn.

# app_localAuthManagerErrorNumberedList1TouchID
source: Go to Touch ID & Passcode in your phone settings.
cy_gb: Fynd i Touch ID & Passcode yng ngosodiadau eich ffôn.

# app_localAuthManagerErrorNumberedList2
source: Tap Turn Passcode On and follow the instructions.
cy_gb: Gwasgu Turn Passcode On a dilyn y cyfarwyddiadau.

# app_localAuthManagerErrorNumberedList3
source: Come back to continue using your GOV.UK Wallet.
cy_gb: Dod yn ôl i barhau i ddefnyddio'ch %@.

# app_localAuthManagerErrorGoToSettingsButton
source: Go to phone settings
cy_gb: Ewch i osodiadau ffôn
